###  Part # 3
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

   = true%0A      + availability_zone                     = (known after apply)%0A      + backup_retention_period               = (known after apply)%0A      + backup_window                         = (known after apply)%0A      + ca_cert_identifier                    = (known after apply)%0A      + character_set_name                    = (known after apply)%0A      + copy_tags_to_snapshot                 = false%0A      + db_name                               = "application"%0A      + db_subnet_group_name                  = "skills-dev-rds-subnet-group"%0A      + delete_automated_backups              = true%0A      + deletion_protection                   = false%0A      + enabled_cloudwatch_logs_exports       = [%0A          + "audit",%0A          + "error",%0A          + "general",%0A          + "slowquery",%0A        ]%0A      + endpoint                              = (known after apply)%0A      + engine                                = "mysql"%0A      + engine_version                        = "5.7"%0A      + engine_version_actual                 = (known after apply)%0A      + hosted_zone_id                        = (known after apply)%0A      + id                                    = (known after apply)%0A      + identifier                            = "skills-dev-db"%0A      + identifier_prefix                     = (known after apply)%0A      + instance_class                        = "db.t3.micro"%0A      + kms_key_id                            = (known after apply)%0A      + latest_restorable_time                = (known after apply)%0A      + license_model                         = (known after apply)%0A      + maintenance_window                    = (known after apply)%0A      + monitoring_interval                   = 0%0A      + monitoring_role_arn                   = (known after apply)%0A      + multi_az                              = (known after apply)%0A      + name                                  = (known after apply)%0A      + nchar_character_set_name              = (known after apply)%0A      + network_type                          = (known after apply)%0A      + option_group_name                     = (known after apply)%0A      + parameter_group_name                  = "slowquery-parameter-group"%0A      + password                              = (sensitive value)%0A      + performance_insights_enabled          = false%0A      + performance_insights_kms_key_id       = (known after apply)%0A      + performance_insights_retention_period = (known after apply)%0A      + port                                  = (known after apply)%0A      + publicly_accessible                   = false%0A      + replica_mode                          = (known after apply)%0A      + replicas                              = (known after apply)%0A      + resource_id                           = (known after apply)%0A      + skip_final_snapshot                   = true%0A      + snapshot_identifier                   = (known after apply)%0A      + status                                = (known after apply)%0A      + storage_type                          = "gp2"%0A      + tags_all                              = (known after apply)%0A      + timezone                              = (known after apply)%0A      + username                              = "application"%0A      + vpc_security_group_ids                = (known after apply)%0A    }%0A%0A  # aws_db_parameter_group.slowQuery will be created%0A  + resource "aws_db_parameter_group" "slowQuery" {%0A      + arn         = (known after apply)%0A      + description = "Slow Query parameter group"%0A      + family      = "mysql5.7"%0A      + id          = (known after apply)%0A      + name        = "slowquery-parameter-group"%0A      + name_prefix = (known after apply)%0A      + tags_all    = (known after apply)%0A%0A      + parameter {%0A          + apply_method = "immediate"%0A          + name         = "log_output"%0A          + value        = "FILE"%0A        }%0A      + parameter {%0A          + apply_method = "immediate"%0A          + name         = "long_query_time"%0A          + value        = "1.0"%0A        }%0A      + parameter {%0A          + apply_method = "immediate"%0A          + name         = "slow_query_log"%0A          + value        = "1"%0A        }%0A    }%0A%0A  # aws_db_subnet_group.this will be created%0A  + resource "aws_db_subnet_group" "this" {%0A      + arn                     = (known after apply)%0A      + description             = "Managed by Terraform"%0A      + id                      = (known after apply)%0A      + name                    = "skills-dev-rds-subnet-group"%0A      + name_prefix             = (known after apply)%0A      + subnet_ids              = (known after apply)%0A      + supported_network_types = (known after apply)%0A      + tags                    = {%0A          + "Name" = "skills-dev-rds-subnet-group"%0A        }%0A      + tags_all                = {%0A          + "Name" = "skills-dev-rds-subnet-group"%0A        }%0A    }%0A%0A  # aws_ecr_lifecycle_policy.this will be created%0A  + resource "aws_ecr_lifecycle_policy" "this" {%0A      + id          = (known after apply)%0A      + policy      = jsonencode(%0A            {%0A              + rules = [%0A                  + {%0A                      + action       = {%0A                          + type = "expire"%0A                        }%0A                      + description  = "keep last 3 images"%0A                      + rulePriority = 1%0A                      + selection    = {%0A                          + countNumber = 3%0A                          + countType   = "imageCountMoreThan"%0A                          + tagStatus   = "any"%0A                        }%0A                    },%0A                ]%0A            }%0A        )%0A      + registry_id = (known after apply)%0A      + repository  = "skills-dev-repo"%0A    }%0A%0A  # aws_ecr_repository.this will be created%0A  + resource "aws_ecr_repository" "this" {%0A      + arn                  = (known after apply)%0A      + id                   = (known after apply)%0A      + image_tag_mutability = "MUTABLE"%0A      + name                 = "skills-dev-repo"%0A      + registry_id          = (known after apply)%0A      + repository_url       = (known after apply)%0A      + tags                 = {%0A          + "Name" = "skills-dev-repo"%0A        }%0A      + tags_all             = {%0A          + "Name" = "skills-dev-repo"%0A        }%0A    }%0A%0A  # aws_ecs_cluster.this will be created%0A  + resource "aws_ecs_cluster" "this" {%0A      + arn                = (known after apply)%0A      + capacity_providers = (known after apply)%0A      + id                 = (known after apply)%0A      + name               = "skills-dev-cluster"%0A      + tags               = {%0A          + "Name" = "skills-dev-fargate-cluster"%0A        }%0A      + tags_all           = {%0A          + "Name" = "skills-dev-fargate-cluster"%0A        }%0A%0A      + default_capacity_provider_strategy {%0A          + base              = (known after apply)%0A          + capacity_provider = (known after apply)%0A          + weight            = (known after apply)%0A        }%0A%0A      + setting {%0A          + name  = "containerInsights"%0A          + value = "enabled"%0A        }%0A    }%0A%0A  # aws_ecs_service.blue will be created%0A  + resource "aws_ecs_service" "blue" {%0A      + cluster                            = (known after apply)%0A      + deployment_maximum_percent         = 200%0A      + deployment_minimum_healthy_percent = 50%0A      + desired_count                      = 2%0A      + enable_ecs_managed_tags            = false%0A      + enable_execute_command             = false%0A      + health_check_grace_period_seconds  = 60%0A      + iam_role                           = (known after apply)%0A      + id                                 = (known after apply)%0A      + launch_type                        = "FARGATE"%0A      + name                               = "skills-dev-service-blue"%0A      + platform_version                   = (known after apply)%0A      + scheduling_strategy                = "REPLICA"%0A      + tags_all                           = (known after apply)%0A      + task_definition                    = (known after apply)%0A      + triggers                           = (known after apply)%0A      + wait_for_steady_state              = false%0A%0A      + load_balancer {%0A          + container_name   = "skills-dev-container"%0A          + container_port   = 8080%0A          + target_group_arn = (known after apply)%0A        }%0A%0A      + network_configuration {%0A          + assign_public_ip = true%0A          + security_groups  = (known after apply)%0A          + subnets          = (known after apply)%0A        }%0A    }%0A%0A  # aws_ecs_task_definition.blue will be created%0A  + resource "aws_ecs_task_definition" "blue" {%0A      + arn                      = (known after apply)%0A      + container_definitions    = (known after apply)%0A      + cpu                      = "512"%0A      + execution_role_arn       = "arn:aws:iam::457234550057:role/ecsTaskExecutionRole"%0A      + family                   = "skills-dev-task-blue"%0A      + id                       = (known after apply)%0A      + memory                   = "1024"%0A      + network_mode             = "awsvpc"%0A      + requires_compatibilities = [%0A          + "FARGATE",%0A        ]%0A      + revision                 = (known after apply)%0A      + skip_destroy             = false%0A      + tags                     = {%0A          + "Environment" = "dev"%0A          + "Name"        = "skills-dev-task"%0A        }%0A      + tags_all                 = {%0A          + "Environment" = "dev"%0A          + "Name"        = "skills-dev-task"%0A        }%0A      + task_role_arn            = "arn:aws:iam::457234550057:role/ecsTaskExecutionRole"%0A    }%0A%0A  # aws_lb.this will be created%0A  + resource "aws_lb" "this" {%0A      + arn                        = (known after apply)%0A      + arn_suffix                 = (known after apply)%0A      + desync_mitigation_mode     = "defensive"%0A      + dns_name                   = (known after apply)%0A      + drop_invalid_header_fields = false%0A      + enable_deletion_protection = false%0A      + enable_http2               = true%0A      + enable_waf_fail_open       = false%0A      + id                         = (known after apply)%0A      + idle_timeout               = 60%0A      + internal                   = false%0A      + ip_address_type            = (known after apply)%0A      + load_balancer_type         = "application"%0A      + name                       = "skills-alb-dev"%0A      + preserve_host_header       = false%0A      + security_groups            = (known after apply)%0A      + subnets                    = (known after apply)%0A      + tags                       = {%0A          + "Environment" = "dev"%0A          + "Name"        = "skills-alb-dev"%0A        }%0A      + tags_all                   = {%0A          + "Environment" = "dev"%0A          + "Name"        = "skills-alb-dev"%0A        }%0A      + vpc_id                     = (known after apply)%0A      + zone_id                    = (known after apply)%0A%0A      + subnet_mapping {%0A          + allocation_id        = (known after apply)%0A          + ipv6_address         = (known after apply)%0A          + outpost_id           = (known after apply)%0A          + private_ipv4_address = (known after apply)%0A          + subnet_id            = (known after apply)%0A        }%0A    }%0A%0A  # aws_route53_record.this["*.nisalikularatne.ca"] will be created%0A  + resource "aws_route53_record" "this" {%0A      + allow_overwrite = true%0A      + fqdn            = (known after apply)%0A      + id              = (known after apply)%0A      + name            = (known after apply)%0A      + records         = (known after apply)%0A      + ttl             = 60%0A      + type            = (known after apply)%0A      + zone_id         = "Z093297817GYDKUHI13ZM"%0A    }%0A%0A  # aws_route53_record.this["nisalikularatne.ca"] will be created%0A  + resource "aws_route53_record" "this" {%0A      + allow_overwrite = true%0A      + fqdn            = (known after apply)%0A      + id              = (known after apply)%0A      + name            = (known after apply)%0A      + records         = (known after apply)%0A      + ttl             = 60%0A      + type            = (known after apply)%0A      + zone_id         = "Z093297817GYDKUHI13ZM"%0A    }%0A%0A  # aws_secretsmanager_secret.this will be created%0A  + resource "aws_secretsmanager_secret" "this" {%0A      + arn                            = (known after apply)%0A      + force_overwrite_replica_secret = false%0A      + id                             = (known after apply)%0A      + name                           = "application-database-password-nineo"%0A      + name_prefix                    = (known after apply)%0A      + policy                         = (known after apply)%0A      + recovery_window_in_days        = 30%0A      + rotation_enabled               = (known after apply)%0A      + rotation_lambda_arn            = (known after apply)%0A      + tags_all                       = (known after apply)%0A%0A      + replica {%0A          + kms_key_id         = (known after apply)%0A          + last_accessed_date = (known after apply)%0A          + region             = (known after apply)%0A          + status             = (known after apply)%0A          + status_message     = (known after apply)%0A        }%0A%0A      + rotation_rules {%0A          + automatically_after_days = (known after apply)%0A        }%0A    }%0A%0A  # aws_secretsmanager_secret_version.rds_credentials will be created%0A  + resource "aws_secretsmanager_secret_version" "rds_credentials" {%0A      + arn            = (known after apply)%0A      + id             = (known after apply)%0A      + secret_id      = (known after apply)%0A      + secret_string  = (sensitive value)%0A      + version_id     = (known after apply)%0A      + version_stages = (known after apply)%0A    }%0A%0A  # aws_secretsmanager_secret_version.this will be created%0A  + resource "aws_secretsmanager_secret_version" "this" {%0A      + arn            = (known after apply)%0A      + id             = (known after apply)%0A      + secret_id      = (known after apply)%0A      + secret_string  = (sensitive value)%0A      + version_id     = (known after apply)%0A      + version_stages = (known after apply)%0A    }%0A%0A  # random_password.this will be created%0A  + resource "random_password" "this" {%0A      + bcrypt_hash      = (sensitive value)%0A      + id               = (known after apply)%0A      + length           = 16%0A      + lower            = true%0A      + min_lower        = 0%0A      + min_numeric      = 0%0A      + min_special      = 0%0A      + min_upper        = 0%0A      + number           = true%0A      + numeric          = true%0A      + override_special = "_!%25^"%0A      + result           = (sensitive value)%0A      + special          = true%0A      + upper            = true%0A    }%0A%0A  # module.dynamic_subnets.aws_eip.default[0] will be created%0A  + resource "aws_eip" "default" {%0A      + allocation_id        = (known after apply)%0A      + association_id       = (known after apply)%0A      + carrier_ip           = (known after apply)%0A      + customer_owned_ip    = (known after apply)%0A      + domain               = (known after apply)%0A      + id                   = (known after apply)%0A      + instance             = (known after apply)%0A      + network_border_group = (known after apply)%0A      + network_interface    = (known after apply)%0A      + private_dns          = (known after apply)%0A      + private_ip           = (known after apply)%0A      + public_dns           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + public_ipv4_pool     = (known after apply)%0A      + tags                 = {%0A          + "Attributes" = "nat"%0A          + "Name"       = "nat-use1a"%0A        }%0A      + tags_all             = {%0A          + "Attributes" = "nat"%0A          + "Name"       = "nat-use1a"%0A        }%0A      + vpc                  = true%0A    }%0A%0A  # module.dynamic_subnets.aws_eip.default[1] will be created%0A  + resource "aws_eip" "default" {%0A      + allocation_id        = (known after apply)%0A      + association_id       = (known after apply)%0A      + carrier_ip           = (known after apply)%0A      + customer_owned_ip    = (known after apply)%0A      + domain               = (known after apply)%0A      + id                   = (known after apply)%0A      + instance             = (known after apply)%0A      + network_border_group = (known after apply)%0A      + network_interface    = (known after apply)%0A      + private_dns          = (known after apply)%0A      + private_ip           = (known after apply)%0A      + public_dns           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + public_ipv4_pool     = (known after apply)%0A      + tags                 = {%0A          + "Attributes" = "nat"%0A          + "Name"       = "nat-use1b"%0A        }%0A      + tags_all             = {%0A          + "Attributes" = "nat"%0A          + "Name"       = "nat-use1b"%0A        }%0A      + vpc                  = true%0A    }%0A%0A  # module.dynamic_subnets.aws_nat_gateway.default[0] will be created%0A  + resource "aws_nat_gateway" "default" {%0A      + allocation_id        = (known after apply)%0A      + connectivity_type    = "public"%0A      + id                   = (known after apply)%0A      + network_interface_id = (known after apply)%0A      + private_ip           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + subnet_id            = (known after apply)%0A      + tags                 = {%0A          + "Attributes" = "nat"%0A          + "Name"       = "nat-use1a"%0A        }%0A      + tags_all             = {%0A          + "Attributes" = "nat"%0A          + "Name"       = "nat-use1a"%0A        }%0A    }%0A%0A  # module.dynamic_subnets.aws_nat_gateway.default[1] will be created%0A  + resource "aws_nat_gateway" "default" {%0A      + allocation_id        = (known after apply)%0A      + connectivity_type    = "public"%0A      + id                   = (known after apply)%0A      + network_interface_id = (known after apply)%0A      + private_ip           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + subnet_id            = (known after apply)%0A      + tags                 = {%0A          + "Attributes" = "nat"%0A          + "Name"       = "nat-use1b"%0A        }%0A      + tags_all             = {%0A          + "Attributes" = "nat"%0A          + "Name"       = "nat-use1b"%0A        }%0A    }%0A%0A  # module.dynamic_subnets.aws_network_acl.private[0] will be created%0A  + resource "aws_network_acl" "private" {%0A      + arn        = (known after apply)%0A      + egress     = (known after apply)%0A      + id         = (known after apply)%0A      + ingress    = (known after apply)%0A      + owner_id   = (known after apply)%0A      + subnet_ids = (known after apply)%0A      + tags       = {%0A          + "Attributes" = "private"%0A          + "Name"       = "private"%0A        }%0A      + tags_all   = {%0A          + "Attributes" = "private"%0A          + "Name"       = "private"%0A        }%0A      + vpc_id     = (known after apply)%0A    }%0A%0A  # module.dynamic_subnets.aws_network_acl.public[0] will be created%0A  + resource "aws_network_acl" "public" {%0A      + arn        = (known after apply)%0A      + egress     = (known after apply)%0A      + id         = (known after apply)%0A      + ingress    = (known after apply)%0A      + owner_id   = (known after apply)%0A      + subnet_ids = (known after apply)%0A      + tags       = {%0A          + "Attributes" = "public"%0A          + "Name"       = "public"%0A        }%0A      + tags_all   = {%0A          + "Attributes" = "public"%0A          + "Name"       = "public"%0A        }%0A      + vpc_id     = (known after apply)%0A    }%0A%0A  # module.dynamic_subnets.aws_network_acl_rule.private4_egress[0] will be created%0A  + resource "aws_network_acl_rule" "private4_egress" {%0A      + cidr_block     = "0.0.0.0/0"%0A      + egress         = true%0A      + from_port      = 0%0A      + id             = (known after apply)%0A      + network_acl_id = (known after apply)%0A      + protocol       = "-1"%0A      + rule_action    = "allow"%0A      + rule_number    = 100%0A      + to_port        = 0%0A    }%0A%0A  # module.dynamic_subnets.aws_network_acl_rule.private4_ingress[0] will be created%0A  + resource "aws_network_acl_rule" "private4_ingress" {%0A      + cidr_block     = "0.0.0.0/0"%0A      + egress         = false%0A      + from_port      = 0%0A      + id             = (known after apply)%0A      + network_acl_id = (known after apply)%0A      + protocol       = "-1"%0A      + rule_action    = "allow"%0A      + rule_number    = 100%0A      + to_port        = 0%0A    }%0A%0A  # module.dynamic_subnets.aws_network_acl_rule.public4_egress[0] will be created%0A  + resource "aws_network_acl_rule" "public4_egress" {%0A      + cidr_block     = "0.0.0.0/0"%0A      + egress         = true%0A      + from_port      = 0%0A      + id             = (known after apply)%0A      + network_acl_id = (known after apply)%0A      + protocol       = "-1"%0A      + rule_action    = "allow"%0A      + rule_number    = 100%0A      + to_port        = 0%0A    }%0A%0A  # module.dynamic_subnets.aws_network_acl_rule.public4_ingress[0] will be created%0A  + resource "aws_network_acl_rule" "public4_ingress" {%0A      + cidr_block     = "0.0.0.0/0"%0A      + egress         = false%0A      + from_port      = 0%0A      + id             = (known after apply)%0A      + network_acl_id = (known after apply)%0A      + protocol       = "-1"%0A      + rule_action    = "allow"%0A      + rule_number    = 100%0A      + to_port        = 0%0A    }%0A%0A  # module.dynamic_subnets.aws_route.nat4[0] will be created%0A  + resource "aws_route" "nat4" {%0A      + destination_cidr_block = "0.0.0.0/0"%0A      + id                     = (known after apply)%0A      + instance_id            = (known after apply)%0A      + instance_owner_id      = (known after apply)%0A      + nat_gateway_id         = (known after apply)%0A      + network_interface_id   = (known after apply)%0A      + origin                 = (known after apply)%0A      + route_table_id         = (known after apply)%0A      + state                  = (known after apply)%0A%0A      + timeouts {%0A          + create = "5m"%0A          + delete = "10m"%0A        }%0A    }%0A%0A  # module.dynamic_subnets.aws_route.nat4[1] will be created%0A  + resource "aws_route" "nat4" {%0A      + destination_cidr_block = "0.0.0.0/0"%0A      + id                     = (known after apply)%0A      + instance_id            = (known after apply)%0A      + instance_owner_id      = (known after apply)%0A      + nat_gateway_id         = (known after apply)%0A      + network_interface_id   = (known after apply)%0A      + origin                 = (known after apply)%0A      + route_table_id         = (known after apply)%0A      + state                  = (known after apply)%0A%0A      + timeouts {%0A          + create = "5m"%0A          + delete = "10m"%0A        }%0A    }%0A%0A  # module.dynamic_subnets.aws_route.public[0] will be created%0A  + resource "aws_route" "public" {%0A      + destination_cidr_block = "0.0.0.0/0"%0A      + gateway_id             = (known after apply)%0A      + id                     = (known after apply)%0A      + instance_id            = (known after apply)%0A      + instance_owner_id      = (known after apply)%0A      + network_interface_id   = (known after apply)%0A      + origin                 = (known after apply)%0A      + route_table_id         = (known after apply)%0A      + state                  = (known after apply)%0A%0A      + timeouts {}%0A    }%0A%0A  # module.dynamic_subnets.aws_route_table.private[0] will be created%0A  + resource "aws_route_table" "private" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = (known after apply)%0A      + tags             = {%0A          + "Attributes" = "private"%0A          + "Name"       = "private-use1a"%0A        }%0A      + tags_all         = {%0A          + "Attributes" = "private"%0A          + "Name"       = "private-use1a"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.dynamic_subnets.aws_route_table.private[1] will be created%0A  + resource "aws_route_table" "private" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = (known after apply)%0A      + tags             = {%0A          + "Attributes" = "private"%0A          + "Name"       = "private-use1b"%0A        }%0A      + tags_all         = {%0A          + "Attributes" = "private"%0A          + "Name"       = "private-use1b"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.dynamic_subnets.aws_route_table.public[0] will be created%0A  + resource "aws_route_table" "public" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = (known after apply)%0A      + tags             = {%0A          + "Attributes" = "public"%0A          + "Name"       = "public"%0A        }%0A      + tags_all         = {%0A          + "Attributes" = "public"%0A          + "Name"       = "public"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.dynamic_subnets.aws_route_table_association.private[0] will be created%0A  + resource "aws_route_table_association" "private" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.dynamic_subnets.aws_route_table_association.private[1] will be created%0A  + resource "aws_route_table_association" "private" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.dynamic_subnets.aws_route_table_association.public[0] will be created%0A  + resource "aws_route_table_association" "public" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.dynamic_subnets.aws_route_table_association.public[1] will be created%0A  + resource "aws_route_table_association" "public" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.dynamic_subnets.aws_subnet.private[0] will be created%0A  + resource "aws_subnet" "private" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.0.0/20"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = "ip-name"%0A      + tags                                           = {%0A          + "Attributes" = "private"%0A          + "Name"       = "private-use1a"%0A        }%0A      + tags_all                                       = {%0A          + "Attributes" = "private"%0A          + "Name"       = "private-use1a"%0A        }%0A      + vpc_id                                         = (known after apply)%0A%0A      + timeouts {%0A          + create = "10m"%0A          + delete = "20m"%0A        }%0A    }%0A%0A  # module.dynamic_subnets.aws_subnet.private[1] will be created%0A  + resource "aws_subnet" "private" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.16.0/20"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = "ip-name"%0A      + tags                                           = {%0A          + "Attributes" = "private"%0A          + "Name"       = "private-use1b"%0A        }%0A      + tags_all                                       = {%0A          + "Attributes" = "private"%0A          + "Name"       = "private-use1b"%0A        }%0A      + vpc_id                                         = (known after apply)%0A%0A      + timeouts {%0A          + create = "10m"%0A          + delete = "20m"%0A        }%0A    }%0A%0A  # module.dynamic_subnets.aws_subnet.public[0] will be created%0A  + resource "aws_subnet" "public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.96.0/20"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = true%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = "ip-name"%0A      + tags                                           = {%0A          + "Attributes" = "public"%0A          + "Name"       = "public-use1a"%0A        }%0A      + tags_all                                       = {%0A          + "Attributes" = "public"%0A          + "Name"       = "public-use1a"%0A        }%0A      + vpc_id                                         = (known after apply)%0A%0A      + timeouts {%0A          + create = "10m"%0A          + delete = "20m"%0A        }%0A    }%0A%0A  # module.dynamic_subnets.aws_subnet.public[1] will be created%0A  + resource "aws_subnet" "public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.112.0/20"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = true%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = "ip-name"%0A      + tags                                           = {%0A          + "Attributes" = "public"%0A          + "Name"       = "public-use1b"%0A        }%0A      + tags_all                                       = {%0A          + "Attributes" = "public"%0A          + "Name"       = "public-use1b"%0A        }%0A      + vpc_id                                         = (known after apply)%0A%0A      + timeouts {%0A          + create = "10m"%0A          + delete = "20m"%0A        }%0A    }%0A%0A  # module.ecs_alb_sg.aws_security_group.cbd[0] will be created%0A  + resource "aws_security_group" "cbd" {%0A      + arn                    = (known after apply)%0A      + description            = "Managed by Terraform"%0A      + egress                 = (known after apply)%0A      + id                     = (known after apply)%0A      + ingress                = (known after apply)%0A      + name                   = (known after apply)%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Attributes" = "ecs-alb"%0A          + "Name"       = "ecs-alb"%0A        }%0A      + tags_all               = {%0A          + "Attributes" = "ecs-alb"%0A          + "Name"       = "ecs-alb"%0A        }%0A      + vpc_id                 = (known after apply)%0A%0A      + timeouts {%0A          + create = "10m"%0A          + delete = "15m"%0A        }%0A    }%0A%0A  # module.ecs_alb_sg.aws_security_group_rule.keyed["HTTP"] will be created%0A  + resource "aws_security_group_rule" "keyed" {%0A      + cidr_blocks              = [%0A          + "0.0.0.0/0",%0A        ]%0A      + description              = "Allow HTTP from everywhere"%0A      + from_port                = 80%0A      + id                       = (known after apply)%0A      + prefix_list_ids          = []%0A      + protocol                 = "tcp"%0A      + security_group_id        = (known after apply)%0A      + security_group_rule_id   = (known after apply)%0A      + self                     = false%0A      + source_security_group_id = (known after apply)%0A      + to_port                  = 80%0A      + type                     = "ingress"%0A    }%0A%0A  # module.ecs_alb_sg.aws_security_group_rule.keyed["HTTPS"] will be created%0A  + resource "aws_security_group_rule" "keyed" {%0A      + cidr_blocks              = [%0A          + "0.0.0.0/0",%0A        ]%0A      + description              = "Allow HTTPS from everywhere"%0A      + from_port                = 443%0A      + id                       = (known after apply)%0A      + prefix_list_ids          = []%0A      + protocol                 = "tcp"%0A      + security_group_id        = (known after apply)%0A      + security_group_rule_id   = (known after apply)%0A      + self                     = false%0A      + source_security_group_id = (known after apply)%0A      + to_port                  = 443%0A      + type                     = "ingress"%0A    }%0A%0A  # module.ecs_alb_sg.aws_security_group_rule.keyed["_allow_all_egress_"] will be created%0A  + resource "aws_security_group_rule" "keyed" {%0A      + cidr_blocks              = [%0A          + "0.0.0.0/0",%0A        ]%0A      + description              = "Allow all egress"%0A      + from_port                = 0%0A      + id                       = (known after apply)%0A      + ipv6_cidr_blocks         = [%0A          + "::/0",%0A        ]%0A      + prefix_list_ids          = []%0A      + protocol                 = "-1"%0A      + security_group_id        = (known after apply)%0A      + security_group_rule_id   = (known after apply)%0A      + self                     = false%0A      + source_security_group_id = (known after apply)%0A      + to_port                  = 0%0A      + type                     = "egress"%0A    }%0A%0A  # module.ecs_alb_sg.null_resource.sync_rules_and_sg_lifecycles[0] will be created%0A  + resource "null_resource" "sync_rules_and_sg_lifecycles" {%0A      + id       = (known after apply)%0A      + triggers = {%0A          + "sg_ids" = (known after apply)%0A        }%0A    }%0A%0A  # module.ecs_alb_sg.random_id.rule_change_forces_new_security_group[0] will be created%0A  + resource "random_id" "rule_change_forces_new_security_group" {%0A      + b64_std     = (known after apply)%0A      + b64_url     = (known after apply)%0A      + byte_length = 3%0A      + dec         = (known after apply)%0A      + hex         = (known after apply)%0A      + id          = (known after apply)%0A      + keepers     = {%0A          + "rules" = jsonencode(%0A                {%0A                  + HTTP               = {%0A                      + cidr_blocks              = [%0A                          + "0.0.0.0/0",%0A                        ]%0A                      + description              = "Allow HTTP from everywhere"%0A                      + from_port                = 80%0A                      + ipv6_cidr_blocks         = []%0A                      + key                      = "HTTP"%0A                      + prefix_list_ids          = []%0A                      + protocol                 = "tcp"%0A                      + security_groups          = []%0A                      + self                     = null%0A                      + source_security_group_id = null%0A                      + to_port                  = 80%0A                      + type                     = "ingress"%0A                    }%0A                  + HTTPS              = {%0A                      + cidr_blocks              = [%0A                          + "0.0.0.0/0",%0A                        ]%0A                      + description              = "Allow HTTPS from everywhere"%0A                      + from_port                = 443%0A                      + ipv6_cidr_blocks         = []%0A                      + key                      = "HTTPS"%0A                      + prefix_list_ids          = []%0A                      + protocol                 = "tcp"%0A                      + security_groups          = []%0A                      + self                     = null%0A                      + source_security_group_id = null%0A                      + to_port                  = 443%0A                      + type                     = "ingress"%0A                    }%0A                  + _allow_all_egress_ = {%0A                      + cidr_blocks              = [%0A                          + "0.0.0.0/0",%0A                        ]%0A                      + description              = "Allow all egress"%0A                      + from_port                = 0%0A                      + ipv6_cidr_blocks         = [%0A                          + "::/0",%0A                        ]%0A                      + key                      = "_allow_all_egress_"%0A                      + prefix_list_ids          = []%0A                      + protocol                 = "-1"%0A                      + security_groups          = []%0A                      + self                     = null%0A                      + source_security_group_id = null%0A                      + to_port                  = 0%0A                      + type                     = "egress"%0A                    }%0A                }%0A            )%0A        }%0A    }%0A%0A  # module.ecs_service_sg.aws_security_group.cbd[0] will be created%0A  + resource "aws_security_group" "cbd" {%0A      + arn                    = (known after apply)%0A      + description            = "Managed by Terraform"%0A      + egress                 = (known after apply)%0A      + id                     = (known after apply)%0A      + ingress                = (known after apply)%0A      + name                   = (known after apply)%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Attributes" = "ecs-primary"%0A          + "Name"       = "ecs-primary"%0A        }%0A      + tags_all               = {%0A          + "Attributes" = "ecs-primary"%0A          + "Name"       = "ecs-primary"%0A        }%0A      + vpc_id                 = (known after apply)%0A%0A      + timeouts {%0A          + create = "10m"%0A          + delete = "15m"%0A        }%0A    }%0A%0A  # module.ecs_service_sg.aws_security_group_rule.keyed["_allow_all_egress_"] will be created%0A  + resource "aws_security_group_rule" "keyed" {%0A      + cidr_blocks              = [%0A          + "0.0.0.0/0",%0A        ]%0A      + description              = "Allow all egress"%0A      + from_port                = 0%0A      + id                       = (known after apply)%0A      + ipv6_cidr_blocks         = [%0A          + "::/0",%0A        ]%0A      + prefix_list_ids          = []%0A      + protocol                 = "-1"%0A      + security_group_id        = (known after apply)%0A      + security_group_rule_id   = (known after apply)%0A      + self                     = false%0A      + source_security_group_id = (known after apply)%0A      + to_port                  = 0%0A      + type                     = "egress"%0A    }%0A%0A  # module.ecs_service_sg.aws_security_group_rule.keyed["_m[0]#HTTPALB#sg#0"] will be created%0A  + resource "aws_security_group_rule" "keyed" {%0A      + description              = "Allow HTTP from ALB"%0A      + from_port                = 8080%0A      + id                       = (known after apply)%0A      + prefix_list_ids          = []%0A      + protocol                 = "tcp"%0A      + security_group_id        = (known after apply)%0A      + security_group_rule_id   = (known after apply)%0A      + self                     = false%0A      + source_security_group_id = (known after apply)%0A      + to_port                  = 8080%0A      + type                     = "ingress"%0A    }%0A%0A  # module.ecs_service_sg.aws_security_group_rule.keyed["_m[0]#OTHERS#sg#0"] will be created%0A  + resource "aws_security_group_rule" "keyed" {%0A      + description              = "Allow non privileged ports"%0A      + from_port                = 31000%0A      + id                       = (known after apply)%0A      + prefix_list_ids          = []%0A      + protocol                 = "tcp"%0A      + security_group_id        = (known after apply)%0A      + security_group_rule_id   = (known after apply)%0A      + self                     = false%0A      + source_security_group_id = (known after apply)%0A      + to_port                  = 61000%0A      + type                     = "ingress"%0A    }%0A%0A  # module.ecs_service_sg.null_resource.sync_rules_and_sg_lifecycles[0] will be created%0A  + resource "null_resource" "sync_rules_and_sg_lifecycles" {%0A      + id       = (known after apply)%0A      + triggers = {%0A          + "sg_ids" = (known after apply)%0A        }%0A    }%0A%0A  # module.ecs_service_sg.random_id.rule_change_forces_new_security_group[0] will be created%0A  + resource "random_id" "rule_change_forces_new_security_group" {%0A      + b64_std     = (known after apply)%0A      + b64_url     = (known after apply)%0A      + byte_length = 3%0A      + dec         = (known after apply)%0A      + hex         = (known after apply)%0A      + id          = (known after apply)%0A      + keepers     = {%0A          + "rules" = (known after apply)%0A        }%0A    }%0A%0A  # module.rds_sg.aws_security_group.cbd[0] will be created%0A  + resource "aws_security_group" "cbd" {%0A      + arn                    = (known after apply)%0A      + description            = "Managed by Terraform"%0A      + egress                 = (known after apply)%0A      + id                     = (known after apply)%0A      + ingress                = (known after apply)%0A      + name                   = (known after apply)%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Attributes" = "rds-sg"%0A          + "Name"       = "rds-sg"%0A        }%0A      + tags_all               = {%0A          + "Attributes" = "rds-sg"%0A          + "Name"       = "rds-sg"%0A        }%0A      + vpc_id                 = (known after apply)%0A%0A      + timeouts {%0A          + create = "10m"%0A          + delete = "15m"%0A        }%0A    }%0A%0A  # module.rds_sg.aws_security_group_rule.keyed["_allow_all_egress_"] will be created%0A  + resource "aws_security_group_rule" "keyed" {%0A      + cidr_blocks              = [%0A          + "0.0.0.0/0",%0A        ]%0A      + description              = "Allow all egress"%0A      + from_port                = 0%0A      + id                       = (known after apply)%0A      + ipv6_cidr_blocks         = [%0A          + "::/0",%0A        ]%0A      + prefix_list_ids          = []%0A      + protocol                 = "-1"%0A      + security_group_id        = (known after apply)%0A      + security_group_rule_id   = (known after apply)%0A      + self                     = false%0A      + source_security_group_id = (known after apply)%0A      + to_port                  = 0%0A      + type                     = "egress"%0A    }%0A%0A  # module.rds_sg.aws_security_group_rule.keyed["_m[0]#ECSINGRESS#sg#0"] will be created%0A  + resource "aws_security_group_rule" "keyed" {%0A      + description              = "Allow ingress to mysql DB"%0A      + from_port                = 3306%0A      + id                       = (known after apply)%0A      + prefix_list_ids          = []%0A      + protocol                 = "tcp"%0A      + security_group_id        = (known after apply)%0A      + security_group_rule_id   = (known after apply)%0A      + self                     = false%0A      + source_security_group_id = (known after apply)%0A      + to_port                  = 3306%0A      + type                     = "ingress"%0A    }%0A%0A  # module.rds_sg.null_resource.sync_rules_and_sg_lifecycles[0] will be created%0A  + resource "null_resource" "sync_rules_and_sg_lifecycles" {%0A      + id       = (known after apply)%0A      + triggers = {%0A          + "sg_ids" = (known after apply)%0A        }%0A    }%0A%0A  # module.rds_sg.random_id.rule_change_forces_new_security_group[0] will be created%0A  + resource "random_id" "rule_change_forces_new_security_group" {%0A      + b64_std     = (known after apply)%0A      + b64_url     = (known after apply)%0A      + byte_length = 3%0A      + dec         = (known after apply)%0A      + hex         = (known after apply)%0A      + id          = (known after apply)%0A      + keepers     = {%0A          + "rules" = (known after apply)%0A        }%0A    }%0A%0A  # module.vpc.aws_default_security_group.default[0] will be created%0A  + resource "aws_default_security_group" "default" {%0A      + arn                    = (known after apply)%0A      + description            = (known after apply)%0A      + egress                 = (known after apply)%0A      + id                     = (known after apply)%0A      + ingress                = (known after apply)%0A      + name                   = (known after apply)%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Name" = "-default"%0A        }%0A      + tags_all               = {%0A          + "Name" = "-default"%0A        }%0A      + vpc_id                 = (known after apply)%0A    }%0A%0A  # module.vpc.aws_internet_gateway.default[0] will be created%0A  + resource "aws_internet_gateway" "default" {%0A      + arn      = (known after apply)%0A      + id       = (known after apply)%0A      + owner_id = (known after apply)%0A      + tags_all = (known after apply)%0A      + vpc_id   = (known after apply)%0A    }%0A%0A  # module.vpc.aws_vpc.default[0] will be created%0A  + resource "aws_vpc" "default" {%0A      + arn                                  = (known after apply)%0A      + assign_generated_ipv6_cidr_block     = false%0A      + cidr_block                           = "10.0.0.0/16"%0A      + default_network_acl_id               = (known after apply)%0A      + default_route_table_id               = (known after apply)%0A      + default_security_group_id            = (known after apply)%0A      + dhcp_options_id                      = (known after apply)%0A      + enable_classiclink                   = (known after apply)%0A      + enable_classiclink_dns_support       = (known after apply)%0A      + enable_dns_hostnames                 = true%0A      + enable_dns_support                   = true%0A      + enable_network_address_usage_metrics = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_tenancy                     = "default"%0A      + ipv6_association_id                  = (known after apply)%0A      + ipv6_cidr_block                      = (known after apply)%0A      + ipv6_cidr_block_network_border_group = (known after apply)%0A      + main_route_table_id                  = (known after apply)%0A      + owner_id                             = (known after apply)%0A      + tags_all                             = (known after apply)%0A    }%0A%0APlan: 71 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + vpc_id = (known after apply)%0A
::debug::stderr: 
::debug::exitcode: 0

  ```
  </details>
  *Pusher: @nisalikularatne, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Deployment - Dev`*